# Analysis

## Imports

In [1]:
import os
import re

from sqlalchemy import create_engine
import numpy as np
import pandas as pd

## Enviroument variables

In [2]:
# export DATABASE_URI='mysql+pymysql://root:root@0.0.0.0:3306/BIKES'
# set DATABASE_URI='mysql+pymysql://root:root@0.0.0.0:3306/BIKES'
DATABASE_URI = os.environ.get('DATABASE_URI')

if not DATABASE_URI:
    raise ValueError('No DATABASE_URI variable was set')

## Database connection

In [3]:
engine = create_engine(DATABASE_URI)
engine.connect()

## 01

    Escreva uma query que retorna a quantidade de linhas na tabela Sales.SalesOrderDetail pelo campo SalesOrderID, desde que tenham pelo menos três linhas de detalhes.

In [6]:
query = """
SELECT  SALES_ORDER_ID,
        COUNT(SALES_ORDER_ID) AS QUANTIDADE_LINHAS
FROM SALES_ORDER_DETAIL
GROUP BY SALES_ORDER_ID
HAVING QUANTIDADE_LINHAS >= 3
ORDER BY QUANTIDADE_LINHAS
"""

In [7]:
pd.read_sql(query, engine)

       SALES_ORDER_ID  QUANTIDADE_LINHAS
0               67872                  3
1               67873                  3
2               67877                  3
3               67882                  3
4               67883                  3
...               ...                ...
12752           47355                 68
12753           51160                 71
12754           53465                 71
12755           51721                 72
12756           51739                 72

[12757 rows x 2 columns]

## 02

    Escreva uma query que ligue as tabelas Sales.SalesOrderDetail, Sales.SpecialOfferProduct e Production.Product e retorne os 3 produtos (Name) mais vendidos (pela soma de OrderQty), agrupados pelo número de dias para manufatura (DaysToManufacture).

In [113]:
query = """
SELECT  T3.NAME,
        T3.DAYS_TO_MANUFACTURE,
        SUM(T1.ORDER_QTY) VENDAS
FROM SALES_ORDER_DETAIL AS T1
LEFT JOIN SPECIAL_OFFER_PRODUCT AS T2 ON T1.SPECIAL_OFFER_ID = T2.SPECIAL_OFFER_ID
LEFT JOIN PRODUCT AS T3 ON T2.PRODUCT_ID = T3.PRODUCT_ID
GROUP BY T3.NAME, T3.DAYS_TO_MANUFACTURE
ORDER BY VENDAS
LIMIT 3
"""

In [114]:
pd.read_sql(query, engine)

                        NAME  DAYS_TO_MANUFACTURE    VENDAS
0  HL Road Frame - Black, 58                    1  238944.0
1    HL Road Frame - Red, 58                    1  238944.0
2     Mountain Bike Socks, L                    0  238944.0

## 03

    Escreva uma query ligando as tabelas Person.Person, Sales.Customer e Sales.SalesOrderHeader de forma a obter uma lista de nomes de clientes e uma contagem de pedidos efetuados.

In [115]:
query = """
SELECT  T1.PERSON_ID,
        CONCAT(T1.FIRST_NAME, ' ', T1.LAST_NAME) AS NAME,
        COUNT(T1.PERSON_ID) AS PEDIDOS
FROM PERSON AS T1
LEFT JOIN CUSTOMER AS T2 ON T1.PERSON_ID = T2.PERSON_ID
LEFT JOIN SALES_ORDER_HEADER AS T3 ON T2.CUSTOMER_ID = T3.CUSTOMER_ID
WHERE T2.PERSON_ID IS NOT NULL
GROUP BY T1.PERSON_ID
ORDER BY PEDIDOS DESC
"""

In [116]:
pd.read_sql(query, engine)

       PERSON_ID              NAME  PEDIDOS
0          15994     Mason Roberts       28
1           4515      Dalton Perez       28
2           3197  Hailey Patterson       27
3           4855   Charles Jackson       27
4           5409     Jason Griffin       27
...          ...               ...      ...
19114       7446       Tammy Lopez        1
19115       7447     Ana Patterson        1
19116       7448    Tammy Martinez        1
19117       7449    Tammy Gonzalez        1
19118       7450        Ana Flores        1

[19119 rows x 3 columns]

## 04

    Escreva uma query usando as tabelas Sales.SalesOrderHeader, Sales.SalesOrderDetail e Production.Product, de forma a obter a soma total de produtos (OrderQty) por ProductID e OrderDate.

In [117]:
query = """
SELECT  T4.PRODUCT_ID,
        T1.ORDER_DATE,
        SUM(T2.ORDER_QTY) AS PEDIDOS
FROM SALES_ORDER_HEADER AS T1
LEFT JOIN SALES_ORDER_DETAIL AS T2 ON T1.SALES_ORDER_ID = T2.SALES_ORDER_ID
LEFT JOIN SPECIAL_OFFER_PRODUCT AS T3 ON T2.SPECIAL_OFFER_ID = T3.SPECIAL_OFFER_ID
LEFT JOIN PRODUCT AS T4 ON T3.PRODUCT_ID = T4.PRODUCT_ID
GROUP BY T4.PRODUCT_ID, T1.ORDER_DATE
"""

In [118]:
pd.read_sql(query, engine)

        PRODUCT_ID ORDER_DATE  PEDIDOS
0              680 2011-05-31    825.0
1              706 2011-05-31    825.0
2              707 2011-05-31    825.0
3              708 2011-05-31    825.0
4              709 2011-05-31    825.0
...            ...        ...      ...
331391         995 2014-06-30     96.0
331392         996 2014-06-30     96.0
331393         997 2014-06-30     96.0
331394         998 2014-06-30     96.0
331395         999 2014-06-30     96.0

[331396 rows x 3 columns]

## 05

    Escreva uma query mostrando os campos SalesOrderID, OrderDate e TotalDue da tabelaSales.SalesOrderHeader. Obtenha apenas as linhas onde a ordem tenha sido feita durante o mês de setembro/2011 e o total devido esteja acima de 1.000. Ordene pelo total devido decrescente.

In [127]:
query = """
SELECT  SALES_ORDER_ID,
        MONTHNAME(ORDER_DATE) AS 'MONTH',
        YEAR(ORDER_DATE) AS 'YEAR',
        TOTAL_DUE
FROM SALES_ORDER_HEADER
WHERE DATE_FORMAT(ORDER_DATE, '%%m/%%Y') = '09/2011' AND tOTAL_DUE > 1000
ORDER BY TOTAL_DUE DESC
"""

In [128]:
pd.read_sql(query, engine)

     SALES_ORDER_ID      MONTH  YEAR  TOTAL_DUE
0             44324  September  2011    3953.99
1             44326  September  2011    3953.99
2             44327  September  2011    3953.99
3             44328  September  2011    3953.99
4             44329  September  2011    3953.99
..              ...        ...   ...        ...
133           44408  September  2011    3729.36
134           44412  September  2011    3729.36
135           44468  September  2011    3729.36
136           44479  September  2011    3729.36
137           44480  September  2011    3729.36

[138 rows x 4 columns]